twoSpeciesFoam/MMS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 0)	//0
    (1 0 0)	//1
    (1 1 0)	//2
    (0 1 0)	//3
    (0 0 0.1)	//4
    (1 0 0.1)	//5
    (1 1 0.1)	//6
    (0 1 0.1)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (

            (1 5 4 0) //bottom
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3) //left
            
        );
    }
    right
    {
        type patch;
        faces
      	(    
      	    (2 6 5 1) //right
      	);    
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
