twoSpeciesFoam/MMS/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #include "include/U_BC";
    /*
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            zeroGradient;
        //value           uniform (0 0 0);
    }
    
    right
    {
        type            zeroGradient;
        //value           uniform (0.01 0 0);
    }
    
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }*/

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
