twoSpeciesFoam/MMS/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/p_BC";
    /*
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    right
    {
        type            fixedValue;
        value		$internalField;
    }
    
    left
    {
        type            zeroGradient;
    }*/

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
