twoSpeciesFoam/MMS/0.orig/Y1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      X1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    #include "include/Y1_BC";
    /*
    bottom
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }
    
    right
    {
        //type            zeroGradient;
        type            fixedValue;
        value		uniform 0.3;
    }
    
    left
    {
        //type            zeroGradient;
        type            fixedValue;
        value		uniform 0.5;
    }*/
    
    frontAndBack
    {
        type            empty;
    }
}



// ************************************************************************* //
