twoSpeciesFoam/MMS/system/firstSpecieSource

firstSpecieSource                                                                            
{                                                                               
	type            scalarCodedSource;                                                           
	selectionMode   all;                                                          
	fields          (Y1);                                                         
                                                                                
	// Name of the coded source                                                   
	name            firstSpecieSource_2;                                                           
                                                                                
	codeInclude                                                                   
	#{                                                                            
		// Info: Include necessary libraries for calculation                        
	#};                                                                           
                                                                                
	codeCorrect                                                                   
	#{                                                                            
		// Info: Apply corrections after the equation has been solved               
	#};                                                                           
                                                                                
	codeConstrain                                                                 
	#{                                                                            
		// Info: Constrain values before the equation is solved                     
	#};                                                                           

	codeAddSup                                                                   
	#{                                                                          
		// Gets the cell volumes of the mesh                                       
		const scalarField& V = mesh_.V();                                          
                                                                               
		// Gets the vector containing cell center position of the mesh             
		const volVectorField& C = mesh().C();                                      
                                                                               
		// Gets the equation source term                                           
		scalarField& Y1Source= eqn.source();                                                    
                                                                             
		// Loops over each cell in the domain                                      
		forAll(Y1Source, cellI)                                                         
		{                                                                         
			// Gets the x component of the current cell 
			const scalar x = C[cellI].x(); 

			//Gets the y component of the current cell 
			const scalar y = C[cellI].y(); 
                                                                             
			const scalar tmp0 = M_PI*(x + y); 
			const scalar tmp1 = Foam::sin(tmp0); 
			const scalar tmp2 = 0.040000000000000001*M_PI; 
			const scalar tmp3 = Foam::cos(tmp0); 
			const scalar tmp4 = M_PI*x; 
			const scalar tmp5 = M_PI*y; 
			const scalar tmp6 = 2*tmp1*tmp3; 
			const scalar solution_Y1 = M_PI*(tmp2*(tmp1*tmp1) - tmp2*tmp3*tmp3 + tmp6*(0.5*Foam::sin(tmp4)*Foam::cos(tmp5) + 1) - tmp6*(0.5*Foam::sin(tmp5)*Foam::cos(tmp4) - 1)); 
                                                                            
			Y1Source[cellI] -= V[cellI]*(solution_Y1);                                                                            
		};                                                                         
	#};                                                                         
}                                                                             

